aa_classwork/w8d1/reddit_clone/app/controllers/users_controller.rb

    def index
       @users = User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"