aa_classwork/w6d3/FirstRoutesAndControllers/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def index
        # # debugger
        @artist = User.find(params[:artist_id]) # -> controllers/1/users/12

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @artwork = Artwork.find(self.params[:id])