aa_classwork/w6d3/FirstRoutesAndControllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "rosemary"], ["email", "rosemary@rosemary.com"], ["created_at", "2020-06-17 19:39:19.212671"], ["updated_at", "2020-06-17 19:39:19.212671"]]
---
    def create
        # params = {
        # "fav_food": "pizza",
        # "controller": "users",
        # "action": "create"
        # }
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "rosemary5"], ["email", "rosemary5@rosemary.com"], ["updated_at", "2020-06-17 20:31:49.478900"], ["id", 3]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)