aa_classwork/w8d1/reddit_clone/app/models/user.rb

    def reset_session_token!
       self.session_token = SecureRandom::urlsafe_base64
       self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "pXu_1qhVrT8KkQRKqI8uEg"], ["updated_at", "2020-06-29 19:45:28.519077"], ["id", 1]]